#include<iostream>
using namespace std;

#define tab "\t"

void FillRand(int** arr, const int m, const int n);
void Print(int** arr, const int m, const int n);

void main()
{
	setlocale(LC_ALL, "");
	int m;	//Количество строк
	int n;	//Количество столбцов

	cout << "Введите количество строк: "; cin >> m;
	cout << "Введите количество элементов строки: "; cin >> n;
	
	////////////////////////////////////////////////////////////////////////
	////////////	объявление двумерного динамического массива		////////
	////////////////////////////////////////////////////////////////////////
	//1) Создаем массив указателей:
	int** arr = new int*[m] {};
	//2) Выделяем память под строки двмерного массива:
	for (int i = 0; i < m; i++)
	{
		arr[i] = new int[n] {};
	}

	////////////////////////////////////////////////////////////////////////
	///////		использование двумерного динамического массива		////////
	////////////////////////////////////////////////////////////////////////
	FillRand(arr, m, n);
	Print(arr, m, n);

	////////////////////////////////////////////////////////////////////////
	//////////////		удаление динамического  массива		////////////////
	////////////////////////////////////////////////////////////////////////
	
	//1) Удаляем строки массива:
	for (int i = 0; i < m; i++)
	{
		delete[] arr[i];
	}
	//2) Удаляем массив указателей:
	delete[] arr;
}
void FillRand(int** arr, const int m, const int n)
{
	for (int i = 0; i < m; i++)
	{
		for (int j = 0; j < n; j++)
		{
			arr[i][j] = rand() % 100;
		}
	}
}
void Print(int** arr, const int m, const int n)
{
	for (int i = 0; i < m; i++)
	{
		for (int j = 0; j < n; j++)
		{
			cout << arr[i][j] << tab;
		}
		cout << endl;
	}
}